/**
* @mainpage
* # Загальне завдання
*  1. Вивести структуру файлів та каталогів, як це робить утиліта tree.
*  2. Визначити об'єм запитаного каталогу.
* 
* # Індивідуальне завдання
*  - Переробити программу, з лабораторної роботи №13, під взаємодію з файлами
* 
* @author Makarenko V.
* @date 20-feb-2021
* @version 0.1
*/
#include "lib.h"

/**
* Головна функція.
*
* Послідовність дій:
* - виклик функціїї tree_function для виконання умови завдання №1
* - виклик функціїї print_size_of_directory для виконання умови завдання №2
* - виклик функціїї do_arithmetic_operation для виконання умови індивідуального завдання
* @return успішний код повернення з програми (0)
*/

int main()
{
    printf("ЗАВДАННЯ №1\n");
    printf("СТРУКТУРА ЦЬОГО КАТАЛОГУ:\n");
    tree_function(".", 1);

    printf("ЗАВДАННЯ №2\n");
    print_size_of_directory();
    
    printf("ІНДИВІДУАЛЬНЕ ЗАВДАННЯ:\n");
    do_arithmetic_operation();
    
    return 0;
}
